Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиНаСчетах.Записывать = Истина;
	ДвижениеСчет = Движения.ОстаткиНаСчетах.Добавить();
	ДвижениеСчет.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеСчет.Период = Дата;
	ДвижениеСчет.Счет = СчетЗачисления;
	ДвижениеСчет.Сумма = Сумма;
	Движения.Доходы.Записывать = Истина;
	ДвижениеДоход = Движения.Доходы.Добавить();
	ДвижениеДоход.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеДоход.Период = Дата;
	ДвижениеДоход.Категория = КатегорияДохода;
	ДвижениеДоход.Сумма = Сумма;
КонецПроцедуры