Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСчетахОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСчетах.Остатки(, Счет = &СчетОтправитель) КАК ОстаткиНаСчетахОстатки";	
	Запрос.УстановитьПараметр("СчетОтправитель", СчетОтправитель);	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	ТекущийОстаток = 0;
	Если Выборка.Следующий() Тогда
		ТекущийОстаток = Выборка.СуммаОстаток;
	КонецЕсли;	
	Если ТекущийОстаток < Сумма Тогда
		Отказ = Истина;
		Сообщить("Недостаточно средств на счете-отправителе! Доступный остаток: " + ТекущийОстаток + ", попытка перевода: " + Сумма);
		Возврат;
	КонецЕсли;
	Движения.ОстаткиНаСчетах.Записывать = Истина;
	ДвижениеСписания = Движения.ОстаткиНаСчетах.Добавить();
	ДвижениеСписания.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеСписания.Период = Дата;
	ДвижениеСписания.Счет = СчетОтправитель;
	ДвижениеСписания.Сумма = Сумма;
	ДвижениеЗачисления = Движения.ОстаткиНаСчетах.Добавить();
	ДвижениеЗачисления.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеЗачисления.Период = Дата;
	ДвижениеЗачисления.Счет = СчетПолучатель;
	ДвижениеЗачисления.Сумма = Сумма;
КонецПроцедуры